Revit 2027 API
Application.ShowGraphicalWarningPipeDisconnects Property
 Whether or not to show the graphical warnings for Pipe disconnects.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowGraphicalWarningPipeDisconnects { get; set; }
Public Property ShowGraphicalWarningPipeDisconnects As Boolean
	Get
	Set
public:
property bool ShowGraphicalWarningPipeDisconnects {
	bool get ();
	void set (bool value);
}
member ShowGraphicalWarningPipeDisconnects : bool with get, set
Property Value
Boolean
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace